from helpers import *

MESSAGE_RULE = """<b> متن قوانین و مقررات </b>"""
MESSAGE_MARKETS = """<b>برای معامله در بازار مورد نظر روی نماد مورد نظر خود کلیک کنید 🔑</b>"""
MESSAGE_PROFILE = """<b>کامل نیست</b>"""
MESSAGE_WALLET = """<b>💳 کیف پول شما 

💸 موجودی تومانی : [BALANCET] تومان
⭐ موجودی استارزی : [BALANCES] استارز 
</b>"""

MESSAGE_PANELMAIN = """<b>▫️ سلام به ربات iBank خوش آمدید .</b>

ما اینجا هستیم تا شما را در زمینه ارز دیجیتال یاری کنیم . در ادامه شما با برخی از امکانات ربات ما آشنا خواهید شد ✨

<b>▪️ دریافت قیمت ارز دیجیتال</b>
🔑 برای مشاهده قیمت یک رمز ارز، از فرمت زیر استفاده کنید:
<pre>فرمت : نام رمز ارز</pre>
<pre>مثال : بیتکوین</pre>
<pre>مثال : 100 استارز</pre>

<b>▪️ تبدیل رمز ارز به رمز ارز دیگر</b>
🔑 برای تبدیل یک رمز ارز به رمز ارز دیگر با مقدار دلخواه، از فرمت زیر استفاده کنید:
<pre>فرمت : نام ارز اول + نام ارز دوم</pre>
<pre>مثال : بیتکوین اتریوم</pre>
<pre>مثال : 100 اتریوم بیتکوین</pre>

<b>▪️ جمع و تفریق رمز ارز ها</b>
🔑 برای جمع و تفریق رمز ارز ها و محاسبه کل دارایی هایتان کافیست از دستور زیر استفاده کنید :
<pre>فرمت : نام ارز اول + علامت + نام ارز دوم</pre>
<pre>مثال : بیتکوین + اتریوم</pre>
<pre>مثال : 1000 اتریوم - بیتکوین</pre>

<b>▪️ مشاهده رمز ارزهای برتر</b>
🔑 برای دریافت اطلاعات بازار و ارزهای برتر:
<pre>/market</pre>

<b>▪️ ارسال خودکار و دوره‌ای قیمت رمز ارز (اختصاصی گروه)</b>
🔑 برای دریافت قیمت به‌صورت منظم (مثلاً هر ۵ دقیقه)، از این دستور استفاده کنید:
<pre>لیست هشدار</pre>


"""
MESSAGE_PANELSUPPORT = """<b>به بخش پشتیبانی خوش آمدید 🤖

لطفا پیام خود را به صورت کامل نوشته و برای ما ارسال کنید ما در سریع ترین زمان ممکن پاسخ خواهیم داد 👇</b>"""

MESSAGE_DEPOSIT_TOMAN = """<b>واریز به حساب به روش کارت به کارت 💳

💳 شماره کارت : <code>[CARD]</code>
👤 نام صاحب حساب : <code>[NAME]</code>

جهت واریز به حساب مبلغ مورد نظر خود را به شماره کارت بالا واریز کنید و سپس عکس رسید آن را به صورت اسکرین شات برای ربات ارسال کنید 👆


</b>"""

MESSAGE_WAIT_DEPOSIT_SENT = """<b> درخواست واریز شما برای ادمین ارسال شد و پس از بررسی حساب شما به صورت خودکار شارژ خواهد شد ⏳

در صورتی که عملیات شارژ حساب شما بیشتر از یک ساعت زمان برد لطفا به پشتیبانی پیام دهید 🔑
</b>"""

MESSAGE_GETDEPOSITSTARS = """<b> چند عدد استارز میخواهید به حساب خود واریز کنید ؟ 🤔</b>"""

MESSAGE_GET_STARS_FOR_WITHDRAWAL = """<b>🤔 چه تعداد استارز رو میخوای برداشت کنی ؟</b>"""
MESSAGE_GET_TMN_FOR_WITHDRAWAL = """<b>🤔 چند هزار تومان رو میخوای برداشت کنی ؟</b>"""

MESSAGE_ENTER_USERNAME_FOR_WITHDRAWAL = "<b>لطفا یوزرنیم شخص مورد نظر را به درستی وارد کنید 🔑</b>"
MESSAGE_ENTER_CARDNUMBER_FOR_WITHDRAWAL = "<b>لطفا شماره کارت و نام صاحب کارت را به شکل صحیح وارد کنید 🔑</b>"

MESSAGE_ERROR_INVALID_AMOUNTTMN_WITHDRAWAL = """<b>مبلغ وارد شده صحیح نمیباشد لطفا یک مبلغ صحیح وارد کنید ❗ 

💰 کمترین مبلغ برداشت  : 50,000 تومان
</b>"""
MESSAGE_ERROR_INVALID_AMOUNTSTARS_WITHDRAWAL = """<b>تعداد وارد شده صحیح نمیباشد لطفا یک عدد صحیح وارد کنید ❗ 

⭐ کمترین تعداد برداشت  : 50 استارز
</b>"""
MESSAGE_GET_COUNT_STARS_FOR_SELL = """<b>چه تعداد استارز رو میخوای به فروش برسونی ؟🤔</b>"""
MESSAGE_GET_COUNT_STARS_FOR_BUY = """<b>چه تعداد استارز رو میخوای به خرید برسونی ؟🤔</b>"""

MESSAGE_ERROR_NOT_ADMIN = "این دستور مخصوص مدیر گروه است . شما ادمین این گروه نیستید ❗"
MESSAGE_ERROR_BOT_NOT_ADMIN = "برای استفاده از این قابلیت ربات باید در گروه شما مدیر باشد ❗"
MESSAGE_ERROR_CURRENCY_NOTFOUND = "<b>ارز وارد شده پیدا نشد . لطفا از صحت نام ارز اطمینان حاصل کنید ❗</b>"
MESSAGE_ERROR_CURRENCY_ALREADY_EXISTS = "<b>این ارز از قبل در لیست هشدار شما وجود دارد  ❗</b>"
MESSAGE_PANELGROUPHELP = """
<b>▪️ دریافت قیمت ارز دیجیتال</b>
🔑 برای مشاهده قیمت یک رمز ارز، از فرمت زیر استفاده کنید:
<pre>فرمت : نام رمز ارز</pre>
<pre>مثال : بیتکوین</pre>
<pre>مثال : 100 استارز</pre>

<b>▪️ تبدیل رمز ارز به رمز ارز دیگر</b>
🔑 برای تبدیل یک رمز ارز به رمز ارز دیگر با مقدار دلخواه، از فرمت زیر استفاده کنید:
<pre>فرمت : نام ارز اول + نام ارز دوم</pre>
<pre>مثال : بیتکوین اتریوم</pre>
<pre>مثال : 100 اتریوم بیتکوین</pre>

<b>▪️ جمع و تفریق رمز ارز ها</b>
🔑 برای جمع و تفریق رمز ارز ها و محاسبه کل دارایی هایتان کافیست از دستور زیر استفاده کنید :
<pre>فرمت : نام ارز اول + علامت + نام ارز دوم</pre>
<pre>مثال : بیتکوین + اتریوم</pre>
<pre>مثال : 1000 اتریوم - بیتکوین</pre>

<b>▪️ مشاهده رمز ارزهای برتر</b>
🔑 برای دریافت اطلاعات بازار و ارزهای برتر:
<pre>/market</pre>

<b>▪️ ارسال خودکار و دوره‌ای قیمت رمز ارز (اختصاصی گروه)</b>
🔑 برای دریافت قیمت به‌صورت منظم (مثلاً هر ۵ دقیقه)، از این دستور استفاده کنید:
<pre>لیست هشدار</pre>



""" 
MESSAGE_GROUP_GET_SYMBOL = """برای افزودن ارز به لیست هشدار قیمت دوره ای کافیست از فرمت زیر استفاده کنید ❗
<pre>🔹 قالب : هشدار + نام رمز ارز</pre>
<pre>▪️ مثال : هشدار بیتکوین
▪️ مثال : هشدار اتریوم</pre>"""
MESSAGE_ERROR_NUMBER_INVALID = "<b>لطفا از صحت ورودی اطمینان حاصل کنید ! ورودی باید یک عدد صحیح باشد </b>" 
MESSAGE_ERROR_TIME_INVALID = "<b>لطفا از صحت ورودی اطمینان حاصل کنید ! ورودی باید یک ساعت از شبانه روز باشد ❗</b>" 
MESSAGE_ERROR_INVALID_AMOUNT = "<b>لطفا یک مبلغ صحیح وارد کنید عدد وارد شده باید یک عدد صحیح باشد ❗\n\n کمترین مبلغ  : 15 استارز ⭐</b>" 
MESSAGE_ERROR_INVALID_USERNAME = "<b>لطفا یک نام کاربری معتبر وارد کنید ! نام کاربری باید با @ شروع شود ❗</b>" 

MESSAGE_WITHDRAWAL_STARS_ADMIN = """<b>برداشت استارز جدید ⏳

⭐ تعداد استارز  : [AMOUNT] استارز
👤 یوزرنیم : <code>[USERNAME]</code>

🔑 اکانت درخواست دهنده : <code>[USERID]</code>
</b>""" 
MESSAGE_WITHDRAWAL_TMN_ADMIN = """<b>برداشت تومانی جدید ⏳

💸 مبلغ  : [AMOUNT] تومان
💳 اطلاعات کارت : <pre>[CARD]</pre>

🔑 اکانت درخواست دهنده : <code>[USERID]</code>

</b>""" 

MESSAGE_WITHDRAWAL_STARS_SUCCESS = """<b>برداشت استارز با موفقیت ثبت شد ✔️

⭐ تعداد استارز  : [AMOUNT] استارز
👤 یوزرنیم : <code>[USERNAME]</code>

لطفا توجه داشته باشید واریز های استارز در ساعات کاری انجام میگردد و در اولیت واریز قرار میگیرند . چنانچه واریز استارز شما در ساعات آینده واریز نشد به پشتیبانی پیام دهید ❗
</b>""" 
MESSAGE_WITHDRAWAL_TMN_SUCCESS = """<b>برداشت تومانی با موفقیت ثبت شد ✔️

💸 مبلغ  : [AMOUNT] تومان
💳 اطلاعات کارت : <pre>[CARD]</pre>

لطفا توجه داشته باشید واریز های تومانی در ساعات کاری انجام میگردد و در اولیت واریز قرار میگیرند . چنانچه واریز تومانی شما در 24 آینده واریز نشد به پشتیبانی پیام دهید ❗
</b>""" 


MESSAGE_ERROR_BALANCE_NOT_ENOUGH_STARS = """<b>موجودی شما کمتر از مبلغ وارد شده است ❗

⭐ موجودی شما : [BALANCE] استارز
</b>""" 
MESSAGE_ERROR_BALANCE_NOT_ENOUGH_WITHDRAWAL_TMN = """<b>موجودی شما کمتر از مبلغ وارد شده است ❗

💰 موجودی شما : [BALANCE] تومان
</b>""" 
MESSAGE_ERROR_BALANCE_NOT_ENOUGH_TMN = """<b>موجودی تومانی شما برای خرید [AMOUNT] استارز کافی نیست ❗
 
💰 قیمت [AMOUNT] استارز : 
[AMOUNTT] تومان

💸 موجودی تومانی شما : [BALANCET] تومان
</b>""" 
MESSAGE_SELL_STARS_COMPLETED = """<b>معامله با موفقیت انجام شد 💸

🔑 جزعیات معامله : فروش استارز

⭐ تعداد استارز : [AMOUNT] استارز
💸 قیمت تومانی : [AMOUNT_TMN] تومانی

💰 موجودی استارزی شما : [BALANCES] استارز
💰 موجودی تومانی شما : [BALANCET] تومان


</b>""" 
MESSAGE_BUY_STARS_COMPLETED = """<b>معامله با موفقیت انجام شد 💸

🔑 جزعیات معامله : خرید استارز

⭐ تعداد استارز : [AMOUNT] استارز
💸 قیمت تومانی : [AMOUNT_TMN] تومانی

💰 موجودی استارزی شما : [BALANCES] استارز
💰 موجودی تومانی شما : [BALANCET] تومان


</b>""" 
MESSAGE_BACK_AFTER_TRADE = "<b>تبریک میگم معامله شما با موفقیت انجام شد ✨</b>" 
MESSAGE_BACK_AFTER_WITHDRAWAL = "<b>تبریک میگم درخواست برداشت شما با موفقیت ثبت شد ✨</b>" 

MESSAGE_ERROR_LIMIT_MAXINTERVAL = "<b>در نسخه رایگان نمیتوانید درخواست ارسال قیمت خودکار بیشتر از 2 ساعت را داشته باشید </b>" 
MESSAGE_ERROR_LIMIT_MININTERVAL = "<b>در نسخه رایگان نمیتوانید درخواست ارسال قیمت خودکار کمتر از 5 دقیقه را داشته باشید </b>" 
MESSAGE_ERROR_LIMIT_ADD_SYMBOL = "متاسفانه شما به حد مجاز ارز های انتخابی در گروه خود رسیده اید ❗"
MESSAGE_ERROR_LIMIT_PREMIUM_ADD_SYMBOL = "متاسفانه شما به حد مجاز ارز های انتخابی در گروه خود رسیده اید ❗"

MESSAGE_ALERT_TIME_CHANGED = """<b>زمان ارسال خودکار قیمت ارز های شما با موفقیت بروزرسانی شد 🟢</b>"""


MESSAGE_GET_ANSWER = "<b>لطفا پاسخ خود را به صورت کامل ارسال کنید ❕</b>"
MESSAGE_ANSWER_SENT = "<b>پاسخ شما با موفقیت ارسال شد ❕</b>"
MESSAGE_GO_TO_MARKET = "<b>همین الان معامله خودت رو میتونی شروع کنی و ارز هارو خرید و فروش کنی ✨</b>"

MESSAGE_SUCCESS_DEPOSIT_STARS = """<b>مبلغ [AMOUNT] استارز با موفقیت به حساب شما واریز شد ✔️

⭐ موجودی فعلی : [BALANCE] استارز
</b>"""

MESSAGE_GROUP_PANEL_SYMBOLS = "<b>در این بخش شما میتوانید به راحتی ارز های مختلفی انتخاب کنید تا ربات به صورت دوره ای قیمت آنها را در گروه یا کانال شما اعلام کند 📢</b>"
MESSAGE_SET_ALERT_TIME = """<b>برای تغییر زمان ارسال قیمت خودکار میتوانید طبق دستور زیر پیش روید : ⏰

🔑 حالت ارسال خودکار قیمت در ساعت خاصی از روز
<pre>قالب : 
/al_h + hour</pre>
<pre>مثال : // ارسال در ساعت 10 عصر
/al_h 22 </pre>
<pre>مثال : // ارسال در ساعت 7 صبح
/al_h 7 </pre>

🔑 حالت ارسال خودکار قیمت به صورت دوره ای
<pre>قالب : 
/al_i + minout</pre>
<pre>مثال : // ارسال هر 10 دقیقه
/al_i 10 </pre>
<pre>مثال : // ارسال هر 1 ساعت
/al_i 60 </pre>
</b>"""

MESSAGE_SENT_TO_CONTACT = "<b>پیام شما را دریافت کردیم در سریع ترین زمان ممکن پاسخ خواهیم داد 🚀</b>"

def get_sell_currency_message(currency_name ,currency_balance ,currency_price_toman ,currency_price_dolar):
    return f"""<b> 🔑 بازار فروش {currency_name}

🪙 قیمت هر واحد {currency_name} 

💸 قیمت تومان : {format_price(currency_price_toman)} تومان
💲 قیمت دلاری : {format_price(currency_price_dolar)} دلار

💰 موجودی شما : {format_price(currency_balance)} {currency_name} ⭐</b>"""

def get_buy_currency_message(currency_name ,tmn_balance ,currency_price_toman ,currency_price_dolar):
    return f"""<b> 🔑 بازار خرید {currency_name}

🪙 قیمت هر واحد {currency_name} 

💸 قیمت تومان : {format_price(currency_price_toman)} تومان
💲 قیمت دلاری : {format_price(currency_price_dolar)} دلار

💰 موجودی شما : {format_price(tmn_balance)} تومان ⭐</b>"""